In [33]:
#importing pandas libraries
import pandas as pd
import numpy  as np
%config IPCompleter.greedy=True

#ref https://pandas.pydata.org/pandas-docs/stable/pandas.pdf

In [3]:
#creating a series with index as Date
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102',periods=6))
print("The index are {} and the value are {} ".format(s1.index,s1.values))

The index are DatetimeIndex(['2013-01-02', '2013-01-03', '2013-01-04', '2013-01-05',
               '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D') and the value are [1 2 3 4 5 6]

In [5]:
#converting a dictionary to a pandas Series
dict1={"India":100,"Japan":200,"Dubai":300}
s2=pd.Series(dict1)
s2

India    100
Japan    200
Dubai    300
dtype: int64

In [6]:
#converting dictionary into DataFrame
dict2={"One":pd.Series([1,2,3], index=["a","b","c"]),
          "Two":pd.Series([1,2,3,4], index=["a","b","c","d"])}
s3=pd.DataFrame(dict2)
s3

   One  Two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [7]:
#adding a column in DataFrame
s3["Three"]=pd.Series([10,20,30], index=["a","b","c"])
s3

   One  Two  Three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [8]:
#importing csv files
dataset1=pd.read_csv("property_data.csv", sep=",", delimiter=None, header="infer")
dataset1

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1.0,850.0
3,100004000.0,201.0,BERKELEY,NaN,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,NaN,1.0,800.0
6,100007000.0,NaN,WASHINGTON,NaN,2.0,NaN,950.0
7,100008000.0,213.0,TREMONT,Y,1.0,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,NaN,2.0,1800.0

In [31]:
#displaying the shape and description of DataFrame
print("The Shape of the DataFrame is {} \n\nThe description are: \n \n{} ".format(dataset1.shape, dataset1.describe()))

The Shape of the DataFrame is (9, 7)

The description are:

                PID      ST_NUM  NUM_BEDROOMS  NUM_BATH        SQ_FT
count  8.000000e+00    7.000000      6.000000  7.000000     7.000000
mean   1.000050e+08  191.428571      2.166667  1.357143  1100.000000
std    2.927700e+03   39.080503      0.983192  0.475595   425.245027
min    1.000010e+08  104.000000      1.000000  1.000000   700.000000
25%    1.000028e+08  199.000000      1.250000  1.000000   825.000000
50%    1.000050e+08  203.000000      2.500000  1.000000   950.000000
75%    1.000072e+08  210.000000      3.000000  1.750000  1300.000000
max    1.000090e+08  215.000000      3.000000  2.000000  1800.000000

In [35]:
#converting DataFrame to json
dataset1.to_json(orient='index')#orient="columns","values","split"

'{"0":{"PID":100001000.0,"ST_NUM":104.0,"ST_NAME":"PUTNAM","OWN_OCCUPIED":"Y","NUM_BEDROOMS":3.0,"NUM_BATH":1.0,"SQ_FT":1000.0},"1":{"PID":100002000.0,"ST_NUM":197.0,"ST_NAME":"LEXINGTON","OWN_OCCUPIED":"N","NUM_BEDROOMS":3.0,"NUM_BATH":1.5,"SQ_FT":null},"2":{"PID":100003000.0,"ST_NUM":null,"ST_NAME":"LEXINGTON","OWN_OCCUPIED":"N","NUM_BEDROOMS":null,"NUM_BATH":1.0,"SQ_FT":850.0},"3":{"PID":100004000.0,"ST_NUM":201.0,"ST_NAME":"BERKELEY","OWN_OCCUPIED":null,"NUM_BEDROOMS":1.0,"NUM_BATH":null,"SQ_FT":700.0},"4":{"PID":null,"ST_NUM":203.0,"ST_NAME":"BERKELEY","OWN_OCCUPIED":"Y","NUM_BEDROOMS":3.0,"NUM_BATH":2.0,"SQ_FT":1600.0},"5":{"PID":100006000.0,"ST_NUM":207.0,"ST_NAME":"BERKELEY","OWN_OCCUPIED":"Y","NUM_BEDROOMS":null,"NUM_BATH":1.0,"SQ_FT":800.0},"6":{"PID":100007000.0,"ST_NUM":null,"ST_NAME":"WASHINGTON","OWN_OCCUPIED":null,"NUM_BEDROOMS":2.0,"NUM_BATH":null,"SQ_FT":950.0},"7":{"PID":100008000.0,"ST_NUM":213.0,"ST_NAME":"TREMONT","OWN_OCCUPIED":"Y","NUM_BEDROOMS":1.0,"NUM_BATH":1.0,"SQ_FT":null},"8":{"PID":100009000.0,"ST_NUM":215.0,"ST_NAME":"TREMONT","OWN_OCCUPIED":"Y","NUM_BEDROOMS":null,"NUM_BATH":2.0,"SQ_FT":1800.0}}'